[
    {
        "title": "\"FTX Founder Donates Millions to US Congress Members\"",
        "article_url": "https://cointopper.com/news/ftx-founder-donates-millions-to-us-congress-members",
        "publish_date": "January 18, 2023",
        "content": "Recent reports have revealed that over one-third of the 535 members of the US Congress have received money from the founder of the cryptocurrency exchange, FTX, Sam Bankman-Fried, or other key members of the company for their political campaigns.\nThis includes prominent figures such as Speaker of the House Kevin McCarthy, Senate Majority leader Chuck Schumer, Congresswoman Nancy Pelosi, and Senator Mitt Romney. Many of these Congress members have been recently appointed and have received cash from Bankman-Fried. The question now arises, where did this funding go?\nMost politicians claim that the money was donated to charities, while others have stated that it has been kept aside with the consent of the US Department of Justice to be used as funds for victims of FTX's collapse. Furthermore, 38% of the recipients have stated that they are holding onto the money until an official statement is made by the government on how to return it. However, bankruptcy expert Anthony Sabino has stated that the process of returning the money may take longer than expected and it is the duty of the court to determine if the cash is accountable for fraud. Interestingly, 37% of the Congress members who received funding from Bankman-Fried are the lawmakers who will be deciding on US regulation for cryptocurrencies. In total, Bankman-Fried and FTX have raised nearly $40 million in political donations during the 2022 political cycle.",
        "image_url": "https://cointopper.com/uploads/topics/ftx-founder-donates-millions-to-us-congress-members-16740380215232.png",
        "source_name": "CoinTopper"
    },
    {
        "title": "Gensler Expresses Concerns About National Security and Cryptocurrency",
        "article_url": "https://cointopper.com/news/gensler-expresses-concerns-about-national-security-and-cryptocurrency",
        "publish_date": "January 12, 2023",
        "content": "Azuki is a decentralized, anime-inspired NFT project that aims to build a brand centered around NFTs. Anime-inspired NFT project Azuki has marked its first anniversary by launching an online city called Hilumia.\nThe virtual hub is designed to be a crossroads of the \"Garden\", listing various brands built by Azuki's community of developers and artists. Hilumia's map will feature billboards advertising upcoming reveals, including an art exhibition, toy store, design studio, and game center. The city also uses \"badges\" given to participants in past Azuki events, such as gyms, dojos, ballrooms, and skateboard communities, to grant access to certain areas.",
        "image_url": "https://cointopper.com/uploads/topics/gensler-expresses-concerns-about-national-security-and-cryptocurrency-16735203424192.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Gensler Expresses Concerns About National Security and Cryptocurrency",
        "article_url": "https://cointopper.com/news/gensler-expresses-concerns-about-national-security-and-cryptocurrency",
        "publish_date": "January 12, 2023",
        "content": "Gary Gensler, chairman of the United States Securities and Exchange Commission (SEC), shared his concerns about the potential dangers of digital currencies with an audience of U.S. soldiers.\nIn a virtual Twitter Spaces event hosted by the U.S. Army Cyber Institute, Gensler highlighted the risk of fraud and manipulation in the crypto market, as well as the possibility of illicit activities such as money laundering and the financing of terrorism. He stated that the crypto market is \"highly speculative\" and \"not yet regulated,\" and advised soldiers not to \"get caught up in the FOMO - the fear of missing out.\" SEC commissioner Caroline Crenshaw also joined the discussion and advised soldiers to invest as much as possible in a Thrift Savings Plan, a government-sponsored retirement plan for federal employees and service members.\nHere is the Tweet:",
        "image_url": "https://cointopper.com/uploads/topics/gensler-expresses-concerns-about-national-security-and-cryptocurrency-16735203424192.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Upcoming Launch Of The Shibarium Beta Network",
        "article_url": "https://cointopper.com/news/upcoming-launch-of-the-shibarium-beta-network",
        "publish_date": "January 05, 2023",
        "content": "It's an exciting time for the Shiba community. They shared a thread about the upcoming Shibarium Beta Network. and shared they are overwhelmed by all of the enthusiasm and support from dedicated followers.",
        "image_url": "https://cointopper.com/uploads/topics/upcoming-launch-of-the-shibarium-beta-network-16729041588448.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "\"Cryptocurrency prices at risk if Grayscale forced to sell trusts\"",
        "article_url": "https://cointopper.com/news/cryptocurrency-prices-at-risk-if-grayscale-forced-to-sell-trusts",
        "publish_date": "January 03, 2023",
        "content": "There is concern that Grayscale, the world's largest cryptocurrency fund provider, may be forced to liquidate some of its altcoin trusts due to the financial troubles of its parent company, Digital Currency Group (DCG).\nThis potential liquidation could impact the prices of already struggling cryptocurrencies, with those most at risk being Ethereum Classic, Horizen, and Zcash. Grayscale holds around 8.5% of the entire Ethereum Classic market cap, 4.6% of Horizen's total cap, and 2.5% of Zcash's market cap.\nThere is also fear that Grayscale may have to liquidate its Bitcoin trust, which holds approximately $10.5 billion in BTC, or 3.3% of the total market cap. The same could potentially happen with the company's Ethereum trust, which holds around 3 million ETH, or 2.5% of its market cap.",
        "image_url": "https://cointopper.com/uploads/topics/cryptocurrency-prices-at-risk-if-grayscale-forced-to-sell-trusts-16727309141981.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "\"Is the Solana Coin Price Increase a Temporary Relief Rally?\"",
        "article_url": "https://cointopper.com/news/is-the-solana-coin-price-increase-a-temporary-relief-rally",
        "publish_date": "January 03, 2023",
        "content": "Solana Coin has seen its price increase by 16% in recent days, prompting speculation that it could be the start of a recovery rally.\nThe sudden price increase has been linked to positive sentiment in the cryptocurrency market and growing demand for fast and scalable blockchain technologies. However, some experts caution that the current recovery may only be a temporary relief rally, as the overall trend in the market remains bearish.\nIn December, the Solana coin price dropped 95.71% from its all-time high of $260.06 due to negative sentiment surrounding the FTX crypto crash. A daily candle closing above $12 could signal a longer-term trend and lead to a 33% price increase to $15. If the daily candle closes below $12, it could indicate that sellers are still in control and prices may struggle to surpass overhead resistance.",
        "image_url": "https://cointopper.com/uploads/topics/is-the-solana-coin-price-increase-a-temporary-relief-rally-16727269171695.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "\"Crypto Technology Expected to Transition to More Established Institutions in 2023, According to Circle Chief Strategy Officer\"",
        "article_url": "https://cointopper.com/news/crypto-technology-expected-to-transition-to-more-established-institutions-in-2023-according-to-circle-chief-strategy-officer",
        "publish_date": "January 03, 2023",
        "content": "According to Circle's Chief Strategy Officer and Head of Global Policy, Dante Disparte, the turmoil in the cryptocurrency industry over the past year may lead to the technology being taken over by more established and regulated institutions in 2023.\nIn a recent blog post for the World Economic Forum, Disparte highlighted the increasing use of cryptocurrency in the financial services sector and argued that the current bear market and exchange collapses could ultimately be beneficial for the industry, paving the way for \"responsible, always-on internet finance\". Disparte also stated that despite the challenges faced by the industry in 2018, mainstream financial services will eventually turn to cryptocurrency due to the technology's prominent role in the global financial world.",
        "image_url": "https://cointopper.com/uploads/topics/crypto-technology-expected-to-transition-to-more-established-institutions-in-2023-according-to-circle-chief-strategy-officer-16727259405656.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "US Accuses 12 Russians For Allegedly using Cryptocurrency against Clinton In 2016 US Elections",
        "article_url": "https://cointopper.com/news/us-accuses-12-russians-for-allegedly-using-cryptocurrency-against-clinton-in-2016-us-elections",
        "publish_date": "July 16, 2018",
        "content": "There was an 11 count federal indictment that was filed against 12 Russian military officers for using cryptocurrency  to hide their true identity in a scheme against the Democratic National Committee and Hillary Clinton's presidential campaign in 2016. They used these digital coins  to do all the transactions and expose stolen election-related documents, keeping their true identities hidden.\nThe group registered the dcleaks.com domain before releasing the stolen documents. rented a virtual private server through an online digital currency service as indicated by the arraignment. From that point onward, they enlisted an URL-shortening account that was utilized to \"Stick and Phish\" the Clinton crusade administrator and \"other campaign-related people\" The group released emails that were stolen from the Clinton campaign during the period of the site launch up to the end of the election. The site was claimed to be run by “American Activists” and it received more than 1 million views after that it was shut down in March 2017. The indictment that was filed by the Department of Justice, indicates that all the accused people are the members of the Main Intelligence Directorate of the General Staff, or GRU, that's part of the Russian military. Not only they are accused of hacking Clinton's campaign but also they hacked the Democratic Congressional Campaign Committee, and the Democratic National Committee in the fake names DCLeaks, Guccifer 2.0, and “another entity”.\nThe case moved further with the help of the cyber teams in Pittsburg, Philadelphia, and San Francisco.\n\nThe charges that were put are:\n\n1. Count 1: criminal conspiracy\n2. Count 2 - 9: Aggravated identify theft\n3. Count 10: Conspiracy to launder money via cryptocurrency\n4. Count 11: Conspiracy to commit an offense against the United States\n\nThe Russian defendants are not in a custody presently, and it isn't clear they will ever show up in the American court, however, the Justice Department has as of late observed an incentive in arraigning foreign hackers in absentia as open prevention.\nFor more updates, follow CoinTopper.com",
        "image_url": "https://cointopper.com/uploads/topics/us-accuses-12-russians-for-allegedly-using-cryptocurrency-against-clinton-in-2016-us-elections-15317264134285.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Cryptocurrency Exchange - Coindelta to launch P2P platform 'Flux'",
        "article_url": "https://cointopper.com/news/cryptocurrency-exchange-coindelta-to-launch-p2p-platform-flux",
        "publish_date": "July 10, 2018",
        "content": " which became effective in the past week and to bypass that a Pune-based cryptocurrency exchange, Coindelta has joined the group of companies who are into peer-to-peer business.\nCoindelta has decided to launch a platform named Flux which will be a P2P platform and will help the exchanges. Flux will go live on 15th July 2018 IST and then will be able to exchange Bitcoin, Ethereum, Ripple, and Tether, a USD backed cryptocurrency.\nShubham Yadav who is the business head of Coindelta explained the working of Flux while talking to MoneyControl.He said that:\nA trader already having a wallet and has cryptocurrency stored in it can put up an offer to sell through this platform. There will be a link generated which could be seen by the other traders on the platform. The trader will then decide his or her sell and the platform will reserve it which will make not allow the user to use that amount until the transaction is completed. The seller as soon as gets the buyer who uses the same link then the deal is done and the buyer will transfer the agreed amount to the seller at a particular time. Once the transaction is confirmed by both the seller and the buyer, Flux will transfer bitcoins from the seller to buyer.\nThe platform also has the feature that is a dispute resolution system which will solve all the disputes swiftly if there is one. The best part of this platform Flux is that even if it gets banned by the Government may be in future then the returns won't be illegal as it was from the period when it was legal.\n For more updates, follow CoinTopper.com",
        "image_url": "https://cointopper.com/uploads/topics/cryptocurrency-exchange-coindelta-to-launch-p2p-platform-flux-15312115714194.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Indian Cryptocurrency Exchange, Zebpay, launches Crypto-to-Crypto trading",
        "article_url": "https://cointopper.com/news/indian-cryptocurrency-exchange-zebpay-launcher-crypto-to-crypto-trading",
        "publish_date": "April 27, 2018",
        "content": "Zebpay, A leading cryptocurrency exchange in India, has launched crypto-with crypto trading on its platform. The launch nearly takes place after the Reserve Bank of India forbidding banks from servicing crypto exchanges. In the interim, Zebpay commended its 3 millionth app download.\nAbout Crypto-to-Crypto Trading\nZebpay was built in 2015 and has its headquarters in Mumbai. It claims to be India's biggest cryptocurrency exchange. In March, the organization said that its application had more than three million downloads, \"making it the most downloaded cryptocurrency application on both iOS and Android in India.\"\nReferring to that its “engineers have been working round-the-clock to launch crypto-to-crypto trading,” the exchange briefed this week:\nZebpay is excited to announce the launch of crypto-to-crypto trading. Now, you can easily exchange one cryptocurrency for another…The first pair we're introducing is ETH/BTC. More crypto pairs coming soon.\nThe the trade cleared up, adding that the fees for all crypto-to-crypto transactions will be charged in bitcoin.Besides, Zebpay tweeted a week ago that \"Initially, this feature will be available to a limited set of users.\"Cryptocurrency Ecosystem in India\nThe crypto community has been developing in India. As per Zebpay, while it is assessed that 10 million Indians are putting resources into financial markets, 5 million Indians are said to trade in cryptocurrencies.“This translates to a market penetration of 60% for Zebpay with its 3 million downloads,” the company emphasized. CTO Mahin Gupta commented:Looking at the Indian milieu, people have started looking at cryptocurrencies not only as an investment option but as a technology that is about to change the future of money.A month ago, the organization also collaborated with one of India's biggest tax filing firms to assist the taxpayers with crypto-related taxes.",
        "image_url": "https://cointopper.com/uploads/topics/indian-cryptocurrency-exchange-zebpay-launcher-crypto-to-crypto-trading-15248289886549.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Goldman Sachs hires Justin Schmidt - a crypto trading expert as the Head of Digital asset",
        "article_url": "https://cointopper.com/news/goldman-sachs-hires-justin-schmidt-a-crypto-trading-expert-as-the-head-of-digital-asset",
        "publish_date": "April 24, 2018",
        "content": "As per Bloomberg, Goldman Sachs Group Inc. has recently hired the crypto trading expert, Justin Schmidt, as head of digital asset markets. The primary goal is to push customers of the bank to gain exposure to the crypto market. Banks in Frankfurt 300x225 - Goldman Sachs Hires Cryptocurrency Trader Expert Justin Schmidt as Head of Digital Asset\nBecause of the rise of virtual currencies the last year, investors are beginning to diversify their portfolios with a specific end goal of gaining exposure in the markets. Be that as it may, some financial institutions like banks, are not prepared to offer customers the services they are requiring. That is the reason Goldman Sachs Group has chosen to hire Justin Schmidt.\nMr. Schmidt was working as Vice President at the securities division in New York. In the meantime, he also worked in the past at quantitative trading firms Seven Eight Capital LLC and WorldQuant LLC.\nSince a few months, Goldman Sachs is endeavoring to offer diverse crypto-related investments to its customers. Without a doubt, the organization was the first to clear Bitcoin prospects offered by the Chicago Board Options Exchange (CBOE) and the Chicago Mercantile Exchange (CME). In the meantime, the organization had plans to begin a trading desk.\nBut there is an expanded interest for virtual currencies and Bitcoin. In any case, there is an issue, as a rule, it is complicated for institutional and traditional investors to find regulated exchanges and or financial institutions that offer crypto-related investments.\nAnd, this is the reason why Goldman Sachs is putting resources into experts that will enable the bank to build its crypto-related offers to its customers.\nTiffany Galvin-Cohen, Bank Spokeswomen remarked: \n    “In response to client interest in various digital products, we are exploring how best to serve them in the space. We have not reached a conclusion on the scope of our digital asset offering.”\nBanks will need to adapt to this new market if they want to keep attracting investors and clients.",
        "image_url": "https://cointopper.com/uploads/topics/goldman-sachs-hires-justin-schmidt-a-crypto-trading-expert-as-the-head-of-digital-asset-15245781176841.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Swiss blockchain SophiaTX rolls out expansion to Asia by collaborating with Cheng & Co",
        "article_url": "https://cointopper.com/news/swiss-blockchain-sophiatx-rolls-out-expansion-to-asia-by-collaborating-with-cheng-co",
        "publish_date": "April 18, 2018",
        "content": "Venaco Group, a parent organization of SophiaTX/Equidato Technologies AG, and Cheng and Co, a main South East Asian bookkeeping and outsourcing administrations association, are satisfied to report their key organization for B2B business and IT anticipates.\nThe two parties commonly consented to explore SophiaTX, the enterprise blockchain platform which is conveying innovation to companies by extending applications like ERP, CRM and others, to explore blockchain technology further to accelerate business growth and opportunities.\nUnder the agreement, Venaco Group will work together with Cheng and Co to give vital business counseling and transformation services to Cheng and Co in order to enhance and expand services provided to its regional clients.\n“We're excited to team up with Cheng & Co as our Asia partner on IT consulting and innovation technology as we believe it will extend our presence and open new doors to opportunities in the market,” said Marian Hires, Managing Partner of Venaco Group and Co-founder of Equidato Technologies AG.\n/“We share a common goal to address the rapidly changing business and operations needs of our B2B customers. By combining Cheng & Co's accounting and outsourcing expertise with our skills and industry know-how in ERP, we enable ourselves to deliver a fully-fledged and comprehensive service to customers in this space,” added Mr. Hires.\nVenaco Group provides independent SAP advisory, implementation and innovation services globally. It has demonstrated capacities for complex SAP programs in the assortment of assignments including global transformations and roll-outs, lean implementations, recovery and turnaround situations, mergers, restructurings, carve-outs, lean operations and support.\nWith key integrations set up, it is urgent for the organization's executive team to have faculty and resources who could center particularly around channel development. The team connected with the Cheng and Co to help expand partner engagement, primarily in the SAP Business One and SAP HANA ERP channel.\n\"Advanced change is promising to convey value to undertakings of all sizes. As organizations extend and develop, it is basic for organizations to advance and adjust to technology propels so as to keep pace with the changing worldwide business scene,\" said Tom Wong, Chief Executive Officer of Cheng and Co.\n\"We have found a great partner in Venaco Group and we believe that by integrating our solutions with its innovative technology, we can create an even more compelling end-to-end value proposition for our clients,\" Wong added.\nThe two organizations anticipate this mutually beneficial partnership and the development it will make.\nKnow more about the SophiaTX Coin here.",
        "image_url": "https://cointopper.com/uploads/topics/swiss-blockchain-sophiatx-rolls-out-expansion-to-asia-by-collaborating-with-cheng-co-15245765039757.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Ripple To Target $1.00 and Beyond",
        "article_url": "https://cointopper.com/news/ripple-to-target-100-and-beyond",
        "publish_date": "April 24, 2018",
        "content": "Will it happen today?\nWould we be able to finally observe Ripple hit the $1.00 target?\nIt's clever isn't it, fourteen days prior, in the event that some individual disclosed to you, Ripple would hit $1.00 amidst April you may have chuckled. Truly, it looked outlandish. Through Ripple's own low value as well as besides, through the poor state of the markets. Basically, negativity assumed control, I trust this is something we are generally blameworthy of applying.\nThe irritating thing about this is at the present time, with Ripple wavering on the edge of $1.00, those 'experts' who called it and said 'Ripple will hit $1.00 in 17 and a large portion of days' or whatever, will now encounter that egotistical inclination, the sentiment 'I disclosed to you so' despite the fact that extremely, their estimations may just have been down to premonition and fortuitous event.\nIn any case, it would seem that their premonitions made them bear. Much appreciated!\nHow is Ripple getting along today?\nAt the time of composing this article, Ripple is valued at $0.913 and is up 4.77%. There is a little approach yet with the correct conditions, Ripple could hit $1.00 soon. With another bull run anticipated and the markets proposing that the following bull run could be soon, we ought to anticipate that Ripple will take after on, with XRP climbing to $1.00 within the near future.\nWe realize that generally speaking, the Ripple community is going for a value of around $3.00 for XRP, this would set Ripple up well regarding its objectives to incorporate XRP into payment and money transfer alternatives. $3.00 takes into consideration straightforward change rates and obviously, makes the currency exceptionally reasonable, along these lines enabling more individuals to make purchases.\nWe likewise realize that a few holders are calling for Ripple to hit $10.00 in any case, I figure this would give a weakness to Ripple, as far as their adoption plans are concerned. $10.00 is as yet reasonable, yet it makes the currency far more expensive and a greater amount of an 'investment' as it were. The holders requiring this obviously need $10.00 to happen, essentially so they can create an immense profit for their investment. That is sensible on account obviously, that is the reason the majority of individuals trade in cryptocurrencies.\nAlong these lines, with Ripple so near $1.00, we do hope to see this objective broke soon. Get the atmosphere right, and the numbers will take after. Should we see another bull run soon, Ripple will stick to this same pattern and climb? When it hits $1.00, intrigue will crest again and perhaps, quite possibly, Ripple will treat us to some more data about their never-ending partnership programs, who knows!",
        "image_url": "https://cointopper.com/uploads/topics/ripple-to-target-100-and-beyond-15245741495691.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "PayPal's Policy Change will influence the Consumers to Take Cryptocurrency More Seriously!",
        "article_url": "https://cointopper.com/news/paypals-policy-change-will-influence-the-consumers-to-take-cryptocurrency-more-seriously",
        "publish_date": "April 19, 2018",
        "content": "Making online payments is possible through various ways. Cryptocurrencies play a developing part of significance in such manner. Taking the crown from any semblance of PayPal won't occur instantly. All things considered, the latter company is rolling out some policy improvements which won't be to everybody's loving.\nPayPal's Policy Changes\nOnline payment processors need to watch out for their rivals. This additionally incorporates rolling out policy improvements which may outrage a reasonable amount of members. For PayPal, their new direction(https://www.paypal.com/us/webapps/mpp/ua/upcoming-policies-full) is quite clear. The variable rate pricing for sending cash outside of the US is being discarded. Rather, beneficiaries of funds will be discriminated based on their nation of residence. A flat charge is to be introduced, which can increase up to $4.99 per transaction.\nMaking the situation worse, there is an additional \"rule\" for credit and debit card clients. This same flat expense will apply, in addition to a settled charge based on the currency, and an extra charge of 2.9% of the transaction amount. In the best case, sending $100 to a nation with a $2.99 flat charge would net the beneficiary $92 or less. This new plan won't be to the preferring of individuals who routinely exchange cash through the PayPal foundation.\nIt is imperative to take note of this does not have any significant bearing to the purchases made through the service. This exclusively relates to individuals who send cash to their family or friends. Anything named as a non-purchase will be liable to this new policy. This makes PayPal a far less ideal alternative for sending cash amongst loved ones. Rather, it might push individuals to alternative solutions.\nA Boost for Cryptocurrency?\nAs of not long ago, PayPal had made some level of impact in the money transfer industry. Particularly where settlements are concerned, the administration offers a sufficient option. These new changes will drive individuals to search for options in such manner. Particularly with unverified users being not able to send cash and make payments, things are not heading the correct way.\nDifferent types of settlement will without a doubt advantage from these policy changes. The likes of TransferWise are considerably less expensive than PayPal, yet somewhat costly too. Cryptocurrencies can have a beneficial outcome in such cases. Not at all like conventional arrangements, Bitcoin and consorts are borderless and can be a great deal less expensive to send cash to another country.\nMore significantly, cryptocurrency doesn't really require a great deal of personal information. Setting up a wallet address involves installing just the right software. Converting cryptocurrency to fiat money may include a KYC method, yet exchanges are showing signs of improvement at handling those processes rapidly. PayPal may successfully be ready for more extensive cryptocurrency adoption in the coming years.",
        "image_url": "https://cointopper.com/uploads/topics/paypals-policy-change-will-influence-the-consumers-to-take-cryptocurrency-more-seriously-15244939164360.png",
        "source_name": "CoinTopper"
    },
    {
        "title": "Bitcoin Scam busted by Crime Cell, 2 arrested from Haryana",
        "article_url": "https://cointopper.com/news/bitcoin-scam-busted-by-crime-cell-2-arrested-from-haryana-india",
        "publish_date": "April 20, 2018",
        "content": "The Haryana Cyber Crime cell today captured two people blamed for running a fake bitcoin investment scheme.\nThe cell captured Deepak Jangra (37) and Deepak Malhotra (56) for the extortion. The team propelled the plan promising exceptional yields for investors through an interest in bitcoin.\nWhat was THE SCAM?\nThe scam got kicked into high gear in December 2016 and investments were welcomed promising exceptional yields to the tune of 12 percent per month. Existing Investors were paid referral expenses and commission for getting new individuals.\nThe members were advised to purchase bitcoins while the investment was taken in cash mode.\nSome segment of this cash was transferred to www.bitmineplus.org. This was a site run by the blamed team.\nAt first, the profits were given as bitcoins. These certainty building measures helped the brains to pull in greater investments.\nThe plan could last just for a couple of months before the air pocket burst. As investors began scrutinizing the pair about the month to month returns, Deepak Jangra presented another cryptocurrency by the name of 'BMP' and attempted to pull in speculators in this new plan.\nHe had intended to move his investors on his new model yet when the rising obligation and the day by day weight from the speculators were expanding. Deepak Jhangra moved his base overnight to dodge the investors.\nAs a result of complaint with the Cyber Crime cell, an inquiry was taken up at Cyber Crime cell and a Special cell and a case were enlisted.\nFollowing up on the data from different sources, the police seized Jangra and Malhotra.",
        "image_url": "https://cointopper.com/uploads/topics/bitcoin-scam-busted-by-crime-cell-2-arrested-from-haryana-15244922966396.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Delhi high court seeks a response from RBI regarding Cryptocurrency Ban",
        "article_url": "https://cointopper.com/news/delhi-high-court-seeks-a-response-from-rbi-regarding-cryptocurrency-ban-india",
        "publish_date": "April 23, 2018",
        "content": "The High Court of Delhi has issued a notice to the Reserve Bank of India (RBI), the Ministry of Finance, and the Goods and Services Tax (GST) Council asserting that RBI's choice to end dealings with crypto organizations violates the constitution, as reported by Times of India outlet.\nThe High Court's notice is primarily because of a case filed by a crypto company Kali Digital a week ago. After the RBI discharged a roundabout on April 5 expressing that they would never again give administrations to a man or a business that deals in cryptocurrency, an online petition to invert the ban was begun, increasing more than 43,000 signatures by press time.\nKali Digital, which runs the crypto exchange - CoinRecoil, set to be launched in August 2018, filed an official claim on April 16, expressing that RBI's circular violates the Articles 19 (1) (g) of the Indian Constitution - allowing citizens the right to any occupation, trade, or business - and Article 14 - prohibiting  discrimination between equals. The High Court of Delhi's notice, issued by Judges S. Ravindra Bhat and A. K. Chawla seeks a response from the three parties involved, by May 24.\nKali Digital understands that RBI's decision will prevent CoinRecoil's business activities in an unlawful way, as indicated by a passage of the case written in nearby news outlet The Economic Times:\n    “On account of the impugned circular, the petitioner will not be able to avail banking services to operate the cryptocurrency exchange 'CoinRecoil'. Such banking services are imperative for the business of the petitioner. Consequently, the business [...] is stillborn.”\nKali Digital incorporated the GST Council in the claim because of what they see as an inability to \"outline fitting regulation on crypto-currency standards [sic] [...] [that] expanded the vulnerability over the treatment of such transactions and is adversely influencing the proposed business of the petitioner,\" the Times of India composes.\nTech investor and crypto enthusiast Tim Draper too had reacted contrarily to the RBI's circular, saying in an interview that the Indian government's refusal to recognize cryptocurrency as valid tender is “the stupidest thing” and that he would have told Prime Minister Narendra Modi that RBI's crypto ban is a “huge mistake.”",
        "image_url": "https://cointopper.com/uploads/topics/delhi-high-court-seeks-a-response-from-rbi-regarding-cryptocurrency-ban-15244912848173.jpg",
        "source_name": "CoinTopper"
    },
    {
        "title": "Cryptocurrency Market Cap crossed the $400 Billion Mark",
        "article_url": "https://cointopper.com/news/cryptocurrency-market-cap-crossed-the-400-billion-mark-news",
        "publish_date": "April 18, 2018",
        "content": "he total cryptocurrency market capitalization reached $400 billion dollars today. Right now of composing this article, the market has an estimation of $400.5 billion – with a pick up of more than $100 billion this month.\nIncrease in the Crypto Market Capitalization\nThe market didn't see a $400 billion market capitalization since the start of March, when the market appeared to recoup some portion of the value lost amid the last critical plunge. The majority of the cryptocurrencies encountered a downtrend since their record-breaking highs that influenced the entire market and its value.\nOver the most recent two weeks, the greater part of the digital currencies in the best 100 positioning, have expanded their value. The downtrend appears in a respite and we could be watching a pattern inversion at this moment.\nThe most critical cryptographic forms of money in the market are Bitcoin (BTC), Ethereum (ETH), Ripple (XRP), Bitcoin Cash (BCH), (EOS), Litecoin (LTC), Cardano (ADA), Stellar (XLM), MIOTA (IOTA), and (NEO). These digital currencies represent 80% of the total crypto market capitalization.\nAt press time, Bitcoin is being traded around $8934, Ethereum at $638,21, Ripple at $0,8739 and Bitcoin Cash at $1,419.\nIn the most recent weeks, some institutional investors have recommended that cryptocurrencies have achieved the least purpose of the year and that now, the following two quarters will give great outcomes for crypto investors.\nAs indicated by Pantera Capital, Bitcoin could cross the $20,000 hindrance that was achieved in December 2017.\nDan Morehead, CEO of Pantera Capital, remarked back in December 2017:\n“Bitcoin could be down 50% next week [in fact it happened] … where it was a month ago, but in a year, it will be much higher than it is today.”\nJohn McAfee specified that for him, $20,000 dollars for each Bitcoin this year is a low expectation. For him, Bitcoin will reach $1 million dollars before the finish of 2020, and he influenced an extremely dazzling bet if Bitcoin does not achieve that price.",
        "image_url": "https://cointopper.com/uploads/topics/cryptocurrency-market-cap-crossed-the-400-billion-mark-news-15244872863095.jpg",
        "source_name": "CoinTopper"
    }
]